@echo off

title ⚡ myShell ⚡


color 0A

echo.

echo   [--------------------------------------------------]

echo    

ping localhost -n 2 >nul

cls



echo.

echo   [==========----------------------------------------]

echo    Waiting

ping localhost -n 2 >nul

cls



echo.

echo   [==============================--------------------]

echo    Loading

ping localhost -n 2 >nul

cls



echo.

echo   [==================================================]

echo    Ready!

ping localhost -n 2 >nul

cls



color 0B

echo.

echo      ██╗  ██╗███████╗██╗     ██╗      ██████╗ 

echo      ██║  ██║██╔════╝██║     ██║     ██╔═══██╗

echo      ███████║█████╗  ██║     ██║     ██║   ██║

echo      ██╔══██║██╔══╝  ██║     ██║     ██║   ██║

echo      ██║  ██║███████╗███████╗███████╗╚██████╔╝

echo      ╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝ ╚═════╝ 

echo.

echo.